circular-cylinder/system/Re_110/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
vertices
(
	(0.5000 0.0000 0.0000)
	(0.3536 0.3536 0.0000)
	(0.0000 0.5000 0.0000)
	(-0.3536 0.3536 0.0000)
	(-0.5000 0.0000 0.0000)
	(-0.3536 -0.3536 0.0000)
	(0.0000 -0.5000 0.0000)
	(0.3536 -0.3536 0.0000)
	(1.0000 0.0000 0.0000)
	(0.7071 0.7071 0.0000)
	(0.0000 1.0000 0.0000)
	(-0.7071 0.7071 0.0000)
	(-1.0000 0.0000 0.0000)
	(-0.7071 -0.7071 0.0000)
	(0.0000 -1.0000 0.0000)
	(0.7071 -0.7071 0.0000)
	(21.5000 0.0000 0.0000)
	(21.5000 0.7071 0.0000)
	(21.5000 6.5000 0.0000)
	(0.7071 6.5000 0.0000)
	(0.0000 6.5000 0.0000)
	(-0.7071 6.5000 0.0000)
	(-3.5000 6.5000 0.0000)
	(-3.5000 0.7071 0.0000)
	(-3.5000 0.0000 0.0000)
	(-3.5000 -0.7071 0.0000)
	(-3.5000 -6.5000 0.0000)
	(-0.7071 -6.5000 0.0000)
	(0.0000 -6.5000 0.0000)
	(0.7071 -6.5000 0.0000)
	(21.5000 -6.5000 0.0000)
	(21.5000 -0.7071 0.0000)
	(0.5000 0.0000 1.0000)
	(0.3536 0.3536 1.0000)
	(0.0000 0.5000 1.0000)
	(-0.3536 0.3536 1.0000)
	(-0.5000 0.0000 1.0000)
	(-0.3536 -0.3536 1.0000)
	(0.0000 -0.5000 1.0000)
	(0.3536 -0.3536 1.0000)
	(1.0000 0.0000 1.0000)
	(0.7071 0.7071 1.0000)
	(0.0000 1.0000 1.0000)
	(-0.7071 0.7071 1.0000)
	(-1.0000 0.0000 1.0000)
	(-0.7071 -0.7071 1.0000)
	(0.0000 -1.0000 1.0000)
	(0.7071 -0.7071 1.0000)
	(21.5000 0.0000 1.0000)
	(21.5000 0.7071 1.0000)
	(21.5000 6.5000 1.0000)
	(0.7071 6.5000 1.0000)
	(0.0000 6.5000 1.0000)
	(-0.7071 6.5000 1.0000)
	(-3.5000 6.5000 1.0000)
	(-3.5000 0.7071 1.0000)
	(-3.5000 0.0000 1.0000)
	(-3.5000 -0.7071 1.0000)
	(-3.5000 -6.5000 1.0000)
	(-0.7071 -6.5000 1.0000)
	(0.0000 -6.5000 1.0000)
	(0.7071 -6.5000 1.0000)
	(21.5000 -6.5000 1.0000)
	(21.5000 -0.7071 1.0000)
);
blocks
(

        //blocks 0-7: blocks surrounding cylinder
        hex (0 8 9 1 32 40 41 33) (20 20 1) simpleGrading (1 1 1)
        hex (2 1 9 10 34 33 41 42) (20 20 1) simpleGrading (1 1 1)
        hex (3 2 10 11 35 34 42 43) (20 20 1) simpleGrading (1 1 1)
        hex (12 4 3 11 44 36 35 43) (20 20 1) simpleGrading (1 1 1)
        hex (13 5 4 12 45 37 36 44) (20 20 1) simpleGrading (1 1 1)
        hex (13 14 6 5 45 46 38 37) (20 20 1) simpleGrading (1 1 1)
        hex (14 15 7 6 46 47 39 38) (20 20 1) simpleGrading (1 1 1)
        hex (7 15 8 0 39 47 40 32) (20 20 1) simpleGrading (1 1 1)

        hex (8 16 17 9 40 48 49 41) (60 20 1) simpleGrading (5 1 1)
        hex (9 17 18 19 41 49 50 51) (60 20 1) simpleGrading (5 5 1)
        hex (10 9 19 20 42 41 51 52) (20 20 1) simpleGrading (1 5 1)
        hex (11 10 20 21 43 42 52 53) (20 20 1) simpleGrading (1 5 1)
        hex (23 11 21 22 55 43 53 54) (20 20 1) simpleGrading (1 5 1)
        hex (24 12 11 23 56 44 43 55) (20 20 1) simpleGrading (1 1 1)
        hex (25 13 12 24 57 45 44 56) (20 20 1) simpleGrading (1 1 1)
        hex (26 27 13 25 58 59 45 57) (20 20 1) simpleGrading (1 0.2 1)
        hex (27 28 14 13 59 60 46 45) (20 20 1) simpleGrading (1 0.2 1)
        hex (28 29 15 14 60 61 47 46) (20 20 1) simpleGrading (1 0.2 1)
        hex (29 30 31 15 61 62 63 47) (60 20 1) simpleGrading (5 0.2 1)
        hex (15 31 16 8 47 63 48 40) (60 20 1) simpleGrading (5 1 1)
	
);
edges
(
	arc 0 1 (0.4330 0.2500 0.0000)
	arc 1 2 (0.2500 0.4330 0.0000)
	arc 2 3 (-0.2500 0.4330 0.0000)
	arc 3 4 (-0.4330 0.2500 0.0000)
	arc 4 5 (-0.4330 -0.2500 0.0000)
	arc 5 6 (-0.2500 -0.4330 0.0000)
	arc 6 7 (0.2500 -0.4330 0.0000)
	arc 7 0 (0.4330 -0.2500 0.0000)
	arc 32 33 (0.4330 0.2500 1.0000)
	arc 33 34 (0.2500 0.4330 1.0000)
	arc 34 35 (-0.2500 0.4330 1.0000)
	arc 35 36 (-0.4330 0.2500 1.0000)
	arc 36 37 (-0.4330 -0.2500 1.0000)
	arc 37 38 (-0.2500 -0.4330 1.0000)
	arc 38 39 (0.2500 -0.4330 1.0000)
	arc 39 32 (0.4330 -0.2500 1.0000)
	arc 8 9 (0.8660 0.5000 0.0000)
	arc 9 10 (0.5000 0.8660 0.0000)
	arc 10 11 (-0.5000 0.8660 0.0000)
	arc 11 12 (-0.8660 0.5000 0.0000)
	arc 12 13 (-0.8660 -0.5000 0.0000)
	arc 13 14 (-0.5000 -0.8660 0.0000)
	arc 14 15 (0.5000 -0.8660 0.0000)
	arc 15 8 (0.8660 -0.5000 0.0000)
	arc 40 41 (0.8660 0.5000 1.0000)
	arc 41 42 (0.5000 0.8660 1.0000)
	arc 42 43 (-0.5000 0.8660 1.0000)
	arc 43 44 (-0.8660 0.5000 1.0000)
	arc 44 45 (-0.8660 -0.5000 1.0000)
	arc 45 46 (-0.5000 -0.8660 1.0000)
	arc 46 47 (0.5000 -0.8660 1.0000)
	arc 47 40 (0.8660 -0.5000 1.0000)
);
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (22 54 55 23)
            (23 55 56 24)
            (24 56 57 25)
            (25 57 58 26)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (50 18 17 49)
            (49 17 16 48)
            (48 16 31 63)
            (63 31 30 62)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (22 54 53 21)
            (21 53 52 20)
            (20 52 51 19)
            (19 51 50 18)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (26 58 59 27)
            (27 59 60 28)
            (28 60 61 29)
            (29 61 62 30)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (1 33 32 0)
            (2 34 33 1)
            (3 35 34 2)
            (35 3 4 36)
            (36 4 5 37)
            (37 5 6 38)
            (7 39 38 6)
            (0 32 39 7)
        );
    }
    frontandback
    {
        type empty;
        faces
        (
            //front
            (8 9 1 0)
            (1 9 10 2)
            (2 10 11 3)
            (3 11 12 4)
            (4 12 13 5)
            (5 13 14 6)
            (6 14 15 7)
            (7 15 8 0)

            (8 16 17 9)
            (9 17 18 19)
            (10 9 19 20)
            (11 10 20 21)
            (23 11 21 22)
            (24 12 11 23)
            (25 13 12 24)
            (26 27 13 25)
            (27 28 14 13)
            (28 29 15 14)
            (29 30 31 15)
            (15 31 16 8)

            //back
            (33 41 40 32)
            (42 41 33 34)
            (43 42 34 35)
            (44 43 35 36)
            (45 44 36 37)
            (46 45 37 38)
            (47 46 38 39)
            (40 47 39 32)

            (41 49 48 40)
            (51 50 49 41)
            (52 51 41 42)
            (53 52 42 43)
            (54 53 43 55)
            (55 43 44 56)
            (56 44 45 57)
            (57 45 59 58)
            (45 46 60 59)
            (46 47 61 60)
            (47 63 62 61)
            (40 48 63 47)
        );
    }
);

mergePatchPairs
(
);
// ************************************************************************* //

